In [1]:
import pandas as pd
import numpy as np

In [22]:
df = pd.read_csv('car_price.csv')

In [23]:
df.head()

  Car Model  Mileage  Price  Age
0    BMW X5    69000  18000    6
1    BMW X5    35000  34000    3
2    BMW X5    57000  26100    5
3    BMW X5    22500  40000    2
4    BMW X5    46000  31500    4

In [24]:
df = df.rename(columns={'Car Model':'Model'})

In [25]:
df.head()

    Model  Mileage  Price  Age
0  BMW X5    69000  18000    6
1  BMW X5    35000  34000    3
2  BMW X5    57000  26100    5
3  BMW X5    22500  40000    2
4  BMW X5    46000  31500    4

In [26]:
df1 = pd.get_dummies(df.Model)
df1

    Audi A5  BMW X5  Mercedez Benz C class
0         0       1                      0
1         0       1                      0
2         0       1                      0
3         0       1                      0
4         0       1                      0
5         1       0                      0
6         1       0                      0
7         1       0                      0
8         1       0                      0
9         0       0                      1
10        0       0                      1
11        0       0                      1
12        0       0                      1

In [28]:
df_new = pd.concat([df,df1],axis=1)
df_new.head()

    Model  Mileage  Price  Age  Audi A5  BMW X5  Mercedez Benz C class
0  BMW X5    69000  18000    6        0       1                      0
1  BMW X5    35000  34000    3        0       1                      0
2  BMW X5    57000  26100    5        0       1                      0
3  BMW X5    22500  40000    2        0       1                      0
4  BMW X5    46000  31500    4        0       1                      0

In [38]:
df_new = df_new.drop(['Model','Audi A5'],axis=1)
df_new.head()

   Mileage  Price  Age  BMW X5  Mercedez Benz C class
0    69000  18000    6       1                      0
1    35000  34000    3       1                      0
2    57000  26100    5       1                      0
3    22500  40000    2       1                      0
4    46000  31500    4       1                      0

In [40]:
X = df_new.drop(['Price'],axis=1)
X.head()

   Mileage  Age  BMW X5  Mercedez Benz C class
0    69000    6       1                      0
1    35000    3       1                      0
2    57000    5       1                      0
3    22500    2       1                      0
4    46000    4       1                      0

In [41]:
y = df.Price
y.head()

0    18000
1    34000
2    26100
3    40000
4    31500
Name: Price, dtype: int64

In [42]:
from sklearn.model_selection import train_test_split

In [89]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.3)

In [90]:
print(X_train.shape,X_test.shape)
print(y_train.shape,y_test.shape)

(9, 4) (4, 4)
(9,) (4,)

In [91]:
X_test.head()

    Mileage  Age  BMW X5  Mercedez Benz C class
8     91000    8       0                      0
12    59000    5       0                      1
6     52000    5       0                      0
1     35000    3       1                      0

In [92]:
from sklearn.linear_model import LinearRegression

In [93]:
lr = LinearRegression()

In [94]:
lr.fit(X_train,y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [95]:
lr.predict([[60000,5,1,0]])

array([25033.46466594])

In [96]:
lr.score(X_test,y_test)

0.8739512413077665